tobbad/micropython/ports/stm32/uart.c
    return true;
}

/* obsolete and unused
bool uart_init(pyb_uart_obj_t *uart_obj, uint32_t baudrate) {
    UART_HandleTypeDef *uh = &uart_obj->uart;
    memset(uh, 0, sizeof(*uh));
    uh->Init.BaudRate = baudrate;
    uh->Init.WordLength = UART_WORDLENGTH_8B;
    uh->Init.StopBits = UART_STOPBITS_1;
    uh->Init.Parity = UART_PARITY_NONE;
    uh->Init.Mode = UART_MODE_TX_RX;
    uh->Init.HwFlowCtl = UART_HWCONTROL_NONE;
    uh->Init.OverSampling = UART_OVERSAMPLING_16;
    return uart_init2(uart_obj);
}
*/

mp_uint_t uart_rx_any(pyb_uart_obj_t *self) {
    int buffer_bytes = self->read_buf_head - self->read_buf_tail;
    if (buffer_bytes < 0) {
        return buffer_bytes + self->read_buf_len;
    } else if (buffer_bytes > 0) {
        return buffer_bytes;
    } else {
        return __HAL_UART_GET_FLAG(&self->uart, UART_FLAG_RXNE) != RESET;
    }
}

// Waits at most timeout milliseconds for at least 1 char to become ready for
// reading (from buf or for direct reading).
// Returns true if something available, false if not.
STATIC bool uart_rx_wait(pyb_uart_obj_t *self, uint32_t timeout) {
    uint32_t start = HAL_GetTick();
    for (;;) {
        if (self->read_buf_tail != self->read_buf_head || __HAL_UART_GET_FLAG(&self->uart, UART_FLAG_RXNE) != RESET) {
            return true; // have at least 1 char ready for reading
        }
        if (HAL_GetTick() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

// assumes there is a character available
int uart_rx_char(pyb_uart_obj_t *self) {
    if (self->read_buf_tail != self->read_buf_head) {
        // buffering via IRQ
        int data;
        if (self->char_width == CHAR_WIDTH_9BIT) {
            data = ((uint16_t*)self->read_buf)[self->read_buf_tail];
        } else {
            data = self->read_buf[self->read_buf_tail];
        }
        self->read_buf_tail = (self->read_buf_tail + 1) % self->read_buf_len;
        if (__HAL_UART_GET_FLAG(&self->uart, UART_FLAG_RXNE) != RESET) {
            // UART was stalled by flow ctrl: re-enable IRQ now we have room in buffer
            __HAL_UART_ENABLE_IT(&self->uart, UART_IT_RXNE);
        }
        return data;
    } else {
        // no buffering
        #if defined(MCU_SERIES_F7) || defined(MCU_SERIES_L4)
        return self->uart.Instance->RDR & self->char_mask;
        #else
        return self->uart.Instance->DR & self->char_mask;
        #endif
    }
}

// Waits at most timeout milliseconds for TX register to become empty.
// Returns true if can write, false if can't.
STATIC bool uart_tx_wait(pyb_uart_obj_t *self, uint32_t timeout) {
    uint32_t start = HAL_GetTick();
    for (;;) {
        if (__HAL_UART_GET_FLAG(&self->uart, UART_FLAG_TXE)) {
            return true; // tx register is empty
        }
        if (HAL_GetTick() - start >= timeout) {
            return false; // timeout
        }
        MICROPY_EVENT_POLL_HOOK
    }
}

// Waits at most timeout milliseconds for UART flag to be set.
// Returns true if flag is/was set, false on timeout.
STATIC bool uart_wait_flag_set(pyb_uart_obj_t *self, uint32_t flag, uint32_t timeout) {
    // Note: we don't use WFI to idle in this loop because UART tx doesn't generate
    // an interrupt and the flag can be set quickly if the baudrate is large.
    uint32_t start = HAL_GetTick();
    for (;;) {
        if (__HAL_UART_GET_FLAG(&self->uart, flag)) {
            return true;
        }
        if (timeout == 0 || HAL_GetTick() - start >= timeout) {
            return false; // timeout
        }
    }
}


STATIC HAL_StatusTypeDef uart_wait_for_state(pyb_uart_obj_t *self, HAL_UART_StateTypeDef state, uint32_t timeout) {
    // Note: we can't use WFI to idle in this loop because the DMA completion
    // interrupt may occur before the WFI.  Hence we miss it and have to wait
    // until the next sys-tick (up to 1ms).
    uint32_t start = HAL_GetTick();
    while ( HAL_UART_GetState(&self->uart) != state) {
        if (HAL_GetTick() - start >= timeout) {
            return HAL_TIMEOUT;
        }
        __WFI();
    }
    return HAL_OK;
}

// src - a pointer to the data to send (16-bit aligned for 9-bit chars)
// num_chars - number of characters to send (9-bit chars count for 2 bytes from src)
// *errcode - returns 0 for success, MP_Exxx on error
// returns the number of characters sent (valid even if there was an error)
STATIC size_t uart_tx_data(pyb_uart_obj_t *self, const void *src_in, size_t num_chars, int *errcode) {
    if (num_chars == 0) {
        *errcode = 0;
        return 0;
    }

    const uint8_t *src = (const uint8_t*)src_in;
    size_t num_tx = 0;

    if (num_chars == 1 || query_irq() == IRQ_STATE_DISABLED || self->tx_dma_descr == NULL) {
		uint32_t timeout;
		if (self->uart.Init.HwFlowCtl & UART_HWCONTROL_CTS) {
			// CTS can hold off transmission for an arbitrarily long time. Apply
			// the overall timeout rather than the character timeout.
			timeout = self->timeout;
		} else {
			// The timeout specified here is for waiting for the TX data register to
			// become empty (ie between chars), as well as for the final char to be
			// completely transferred.  The default value for timeout_char is long
			// enough for 1 char, but we need to double it to wait for the last char
			// to be transferred to the data register, and then to be transmitted.
			timeout = 2 * self->timeout_char;
		}
        while (num_tx < num_chars) {
            if (!uart_wait_flag_set(self, UART_FLAG_TXE, timeout)) {
                *errcode = MP_ETIMEDOUT;
                return num_tx;
            }
            USART_TypeDef *uart = self->uart.Instance;
            uint32_t data;
            if (self->char_width == CHAR_WIDTH_9BIT) {
                data = *((uint16_t*)src) & 0x1ff;
                src += 2;
            } else {
                data = *src++;
            }
            #if defined(MCU_SERIES_F4)
            uart->DR = data;
            #else
            uart->TDR = data;
            #endif
            ++num_tx;
        }
		// wait for the UART frame to complete
		if (!uart_wait_flag_set(self, UART_FLAG_TC, timeout)) {
			*errcode = MP_ETIMEDOUT;
			return num_tx;
		}
    } else {
        HAL_StatusTypeDef status;
    	uint16_t byte_cnt = num_chars;
    	if (tx_dma.Instance != NULL) {
        	*errcode = MP_EBUSY;
        	return 0;
    	}
    	dma_init(&tx_dma, self->tx_dma_descr, &self->uart);
    	if (self->char_width == CHAR_WIDTH_9BIT) {
    		byte_cnt *= 2;
    		tx_dma.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    		tx_dma.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
            HAL_DMA_DeInit(&tx_dma);
            HAL_DMA_Init(&tx_dma);
    	}
    	// Other half of __HAL_LINKDMA(data, xxx, *dma)
    	self->uart.hdmatx = &tx_dma;
        MP_HAL_CLEAN_DCACHE(src, byte_cnt);
        self->tx_tick_start = mp_hal_ticks_us();
        status = HAL_UART_Transmit_DMA(&self->uart, (uint8_t*)src, num_chars);
        if (status == HAL_BUSY) {
        	*errcode = MP_EBUSY;
        	return 0;
        }
        if (status == HAL_OK) {
            status = uart_wait_for_state(self, HAL_UART_STATE_READY, self->timeout);
			if (status == HAL_TIMEOUT) {
				uint32_t tx_tick_stop = mp_hal_ticks_us();
				printf("TX non blocking %d us\r\n", (int)(tx_tick_stop-self->tx_tick_start));
				*errcode = MP_EWOULDBLOCK;
				return 0;
			} else if (status == HAL_OK) {
				uint32_t tx_tick_stop = mp_hal_ticks_us();
				printf("TX time %d us\r\n", (int)(tx_tick_stop-self->tx_tick_start));
			}
        }
		if (status != HAL_OK) {
			mp_hal_raise(status);
		}
        num_tx = num_chars;
    }

